Revit 2027 API
IFCExtrusionCreationData.GetOpenings Method
 Gets a collection of all of the openings stored in this data.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IFCExtrusionData> GetOpenings()
Public Function GetOpenings As IList(Of IFCExtrusionData)
public:
IList<IFCExtrusionData^>^ GetOpenings()
member GetOpenings : unit -> IList<IFCExtrusionData>
Return Value
IList<IFCExtrusionData>
 The opening information.
Remarks
 Contains all of the openings stored via AddOpening().
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace